Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Annotate the statement inspector implementation with the `@PersistenceUnitExtension` qualifier to tell Quarkus it should be used in the default persistence unit.
ja_jp: ステートメントインスペクターの実装に `@PersistenceUnitExtension` という修飾子を付けて、Quarkus にデフォルトの永続化ユニットで使用するように指示します。

source: Annotate your persistent objects with `@Entity`, then add the relevant configuration properties in `{config-file}`.
ja_jp: `@Entity` で永続オブジェクトにアノテーションを付けてから、 `{config-file}` で関連する設定プロパティーを追加します。

source: Annotate your persistent objects with `@Entity`, then add the relevant configuration properties in `{config-file}`:
ja_jp: `@Entity` でパーシステント・オブジェクトにアノテーションを付け、 `{config-file}` で関連する設定プロパティを追加します。

source: Annotated beans examples
ja_jp: アノテーション付きBeanの例

source: Annotated with the `@RequestScoped` annotation.
ja_jp: `@RequestScoped` アノテーションが付けられています。

source: Annotating a method in any CDI aware bean with the `io.opentelemetry.extension.annotations.WithSpan` annotation will create a new Span and establish any required relationships with the current Trace context.
ja_jp: CDI を意識した Bean のメソッドに `io.opentelemetry.extension.annotations.WithSpan` というアノテーションを付けると、新しい Span が作成され、現在の Trace コンテキストと必要な関係が確立されます。

source: Annotating a method in any CDI aware bean with the `io.opentelemetry.instrumentation.annotations.AddingSpanAttributes` will not create a new span but will add annotated method parameters to attributes in the current span.
ja_jp: CDI 対応の任意の Bean のメソッドに `io.opentelemetry.instrumentation.annotations.AddingSpanAttributes` アノテーションを付与すると、新しい Span は作成されませんが、アノテーションが付けられたメソッドのパラメーターが現在の Span の属性として追加されます。

source: Annotating a method in any CDI aware bean with the `io.opentelemetry.instrumentation.annotations.WithSpan` annotation will create a new Span and establish any required relationships with the current Trace context.
ja_jp: CDI 対応の任意の Bean のメソッドに `io.opentelemetry.instrumentation.annotations.WithSpan` アノテーションを付与すると、新しい Span が作成され、現在の Trace コンテキストとの必要な関係が確立されます。

source: Annotating with `@MongoEntity` is optional. Here the entity will be stored in the `ThePerson` collection instead of the default `Person` collection.
ja_jp: `@MongoEntity` でのアノテーションはオプションです。ここでは、エンティティは、デフォルトの `Person` コレクションではなく、 `ThePerson` コレクションに保存されます。

source: Annotation
ja_jp: アノテーション

source: Annotation based Serialization
ja_jp: アノテーションに基づくシリアライゼーション

source: Annotation type
ja_jp: アノテーション型

source: Annotation value examples
ja_jp: アノテーション値の例

source: Annotation-based permissions do not work with custom xref:security-customization.adoc#jaxrs-security-context[Jakarta REST SecurityContexts] because there are no permissions in `jakarta.ws.rs.core.SecurityContext`.
ja_jp: `jakarta.ws.rs.core.SecurityContext` には権限がないため、アノテーションベースの権限はカスタム xref:security-customization.adoc#jaxrs-security-context[Jakarta REST SecurityContexts] では機能しません。

source: Annotation-based test resources
ja_jp: アノテーションベースのテストリソース

source: Annotations
ja_jp: アノテーション

source: Announcing RESTEasy Reactive
ja_jp: RESTEasy Reactiveの発表

source: Anonymous application name. SHA-256 hash of the Group Id + Artifact Id.
ja_jp: 匿名アプリケーション名。Group Id + Artifact Id の SHA-256 ハッシュ。

source: Anonymous application version. SHA-256 hash of the Artifact Id + Version.
ja_jp: 匿名アプリケーションのバージョン。Artifact Id + VersionのSHA-256ハッシュ。

source: Anonymous user id. During the 1st build, this is generated locally at random, and subsequently reused.
ja_jp: 匿名ユーザーID。1回目のビルドの際、これはローカルでランダムに生成され、その後再利用されます。

source: Another SmallRye specific experimental feature, allows you to map an existing scalar (that is mapped by the implementation to a certain Java type) to another type, or to map complex object, that would typically create a `Type` or `Input` in GraphQL, to an existing scalar.
ja_jp: また、SmallRye特有の実験的な機能として、既存のスカラー（実装によって特定のJava型にマッピングされている）を別の型にマッピングしたり、GraphQLで通常 `Type` や `Input` を作成するような複雑なオブジェクトを既存のスカラーにマッピングしたりすることができます。

source: Another alternative style provided by Quarkus is to create `GreetingConfiguration` as an interface:
ja_jp: Quarkusが提供するもう一つの代替スタイルは、インターフェイスとして `GreetingConfiguration` を作成することです。

source: Another approach for a stateful token storage strategy is a custom `TokenStateManager` provided by Quarkus to have your application store tokens in a Redis cache. If you decided to use the OIDC Redis Token State Manager, you must add the following dependency:
ja_jp: ステートフルトークンストレージストラテジーの別の方法として、、Quarkus が提供するカスタム `TokenStateManager` を使用して、アプリケーションでトークンを Redis キャッシュに保存する方法があります。 OIDC Redis Token State Manager を使用する場合は、次の依存関係を追加する必要があります。

source: Another approach is to provide a localhost with port bindings configuration.
ja_jp: もう一つのアプローチは、ポートバインディング設定を持つ localhost を提供することです。

source: Another approach is to provide it programmatically when creating the client:
ja_jp: 別の方法として、クライアントを作成するときにプログラムで提供する方法があります。

source: Another approach is to provide the custom HTTP Client options when creating the client programmatically:
ja_jp: もう一つの方法は、コードを用いてでクライアントを作成する際に、カスタムHTTPクライアントオプションを提供することです。

source: Another approach to stateful token storage is to use the custom `TokenStateManager` provided by Quarkus to store tokens in a Redis cache. If you decided to use the OIDC Redis Token State Manager, you must add the following dependency:
ja_jp: ステートフルトークンストレージのもう 1 つの方法は、Quarkus が提供するカスタム `TokenStateManager` を使用して、トークンを Redis キャッシュに保存することです。 OIDC Redis Token State Manager を使用する場合は、次の依存関係を追加する必要があります。

source: Another area for improvement was the creation of large JAR archives, which is inherently slow because it involves reading and compressing a significant number of resources, making it both I/O- and CPU-intensive. Until now, we were building JARs using a ZipFileSystem, adding resources one by one in a single thread. We have since switched to using the parallel compression support provided by Commons Compress.
ja_jp: もう一つの改善点は、大規模なJARアーカイブの作成でした。これは、大量のリソースを読み取り、圧縮することを含むため、本質的に低速であり、I/OとCPUの両方を大量に消費します。これまで、私たちはZipFileSystemを使用して、シングルスレッドでリソースを一つずつ追加しながらJARを構築していました。それ以来、Commons Compressが提供する並列圧縮サポートを使用するように切り替えました。

source: Another bean receives this message and computes the response
ja_jp: 別の Bean がこのメッセージを受信して、レスポンスを計算します。

source: Another benefit of STM is composability and modularity. You can write concurrent Quarkus objects/services that can be easily composed with any other services built using STM, without exposing the details of how the objects/services are implemented. As we discussed earlier, this ability to compose objects you wrote with those other teams may have written weeks, months or years earlier, and have A, C and I properties can be hugely beneficial. Furthermore, some STM implementations, including the one Quarkus uses, support nested transactions and these allow changes made within the context of a nested (sub) transaction to later be rolled back by the parent transaction.
ja_jp: STM のもう 1 つの利点は、構成可能性とモジュール性です。オブジェクト/サービスの実装詳細を公開することなく、STM を使用して構築された他の任意のサービスと簡単に構成することができる Quarkus オブジェクト/サービスを並行して書くことができます。先ほど説明したように、他のチームと一緒に書いたオブジェクトを、数週間、数ヶ月、数年前に書いたかもしれない、A、C、I のプロパティーのあるオブジェクトをコンパイルできるこの機能は、非常に有益です。さらに、Quarkus が使用しているものを含むいくつかの STM 実装では、入れ子になったトランザクションをサポートしており、入れ子になった (サブ) トランザクションのコンテキスト内で行われた変更を、後で親トランザクションによってロールバックすることができます。

source: Another benefit of modular applications is that they can reduce the code-set that will need to get into the native executable. The smaller the code-set, the faster the native executable builds will be and the smaller the native executable produced.
ja_jp: モジュラーアプリケーションのもう 1 つの利点は、ネイティブ実行可能ファイルに組み込む必要があるコードセットを削減できることです。コードセットが小さいほど、ネイティブ実行可能ファイルのビルドが高速になり、生成されるネイティブ実行可能ファイルが小さくなります。

source: Another benefit with native executable mode is that Substrate can more easily eliminate features that are not used. If features are directly initialized via bytecode, Substrate can detect that a method is never called and eliminate that method. If config is read at runtime, Substrate cannot reason about the contents of the config and so needs to keep all features in case they are required.
ja_jp: ネイティブ実行可能ファイルモードのもう一つの利点は、サブストレートが使われない機能をより簡単に排除できることです。機能がバイトコードで直接初期化される場合、Substrateはメソッドが一度も呼ばれていないことを検知し、そのメソッドを削除することができます。また、実行時に設定を読み込む場合、サブストレートは設定の内容を推論することができないため、必要な場合に備えてすべての機能を残しておく必要があります。

source: Another challenge was related to native build time, memory and CPU usage during those builds. The approach we took was to only generate a native executable on master, and run tests in jvm mode on the feature branches. We would still have an option to test against native in a particular feature branch if we needed to. But unless we were integrating a new library, getting the jvm tests to pass gave us sufficient confidence that we would have an identical behavior in native.
ja_jp: もう一つの課題は、ネイティブビルドの時間と、その間のメモリとCPUの使用量に関するものでした。そこで私たちがとった方法は、マスターでのみネイティブ実行可能ファイルを生成し、フィーチャーブランチではjvmモードでテストを実行するというものでした。必要であれば、特定のフィーチャーブランチでネイティブテストを行うという選択肢もあります。しかし、新しいライブラリを統合するのでなければ、jvmテストを通過させることで、ネイティブでも同様の動作をするという十分な自信を持つことができました。

source: Another common pattern in the JAX-RS world is to use the `Response` object. `Response` comes with some nice perks:
ja_jp: JAX-RSの世界では、 `Response` オブジェクトを使用するのがもう一つの一般的なパターンです。 `Response` にはいくつかの素晴らしい特典があります。

source: Another common pattern in the Jakarta REST world is to use the `Response` object. `Response` comes with some nice perks:
ja_jp: Jakarta RESTの世界でよく見られるもう一つのパターンは、 `Response` オブジェクトを使うことです。 `Response` には、いくつかの良い特典があります:

source: Another common source of errors is when the image heap taken by GraalVM contains a `Random`/`SplittableRandom` instance:
ja_jp: もう一つのよくあるエラーの原因は、GraalVMによって取得されたイメージヒープが `Random` / `SplittableRandom` インスタンスを含んでいる場合です。

source: Another example is JBoss Logging internationalization: it attempts to load a class for the current locale, and if that class doesn't exist, it falls back to the default class.
ja_jp: 別の例は JBoss Logging の国際化です。現在のロケールのクラスをロードしようとし、そのクラスが存在しない場合はデフォルトのクラスにフォールバックします。

source: Another example would be defining different database servers by profile:
ja_jp: 別の例としては、プロファイルで異なるデータベースサーバーを定義できます。

source: Another example, `supportedSubmitMethods` can hide the `Try it out` button for certain HTTP Method Types:
ja_jp: 別の例として、 `supportedSubmitMethods` は特定の HTTP メソッドタイプに対して `Try it out` ボタンを非表示にすることができます。

source: Another important requirement for authentication is to ensure that the data on which the session is based is up-to-date without requiring the user to authenticate for every single request. There are also situations where a logout event is explicitly requested.
ja_jp: 認証に関するもう 1 つの重要な要件は、ユーザーにすべてのリクエストに対して認証を要求することなく、セッションの基となるデータが最新であることを保証することです。 また、ログアウトイベントが明示的に要求される状況もあります。

source: Another important requirement for authentication is to ensure that the data the session is based on is up-to-date without requiring the user to authenticate for every single request. There are also situations where a logout event is explicitly requested. Use the following key points to find the right balance for securing your Quarkus applications:
ja_jp: 認証のもう一つの重要な要件は、ユーザがリクエストのたびに認証を要求することなく、 セッションの基となるデータが最新であることを保証することです。 また、ログアウトイベントが明示的に要求される状況もあります。 以下のポイントを参考に、Quarkusアプリケーションのセキュリティを確保するための適切なバランスを見つけましょう：

source: Another new feature available in Quarkus (version 1.10+) is the ability to set any of the https://swagger.io/docs/open-source-tools/swagger-ui/usage/configuration/[configuration options] available in Swagger UI. As an example, we can set the `urls` and add the petstore (as the default selected option) to Swagger UI:
ja_jp: Quarkus(バージョン1.10+)で利用できるもう一つの新機能は、Swagger UIで利用できる https://swagger.io/docs/open-source-tools/swagger-ui/usage/configuration/[設定オプション]を任意に設定できることです。例えば、 `urls` を設定して、Swagger UI にペットストア(デフォルトで選択されているオプションとして)を追加することができます。

source: Another notable one is the addition of `quarkus.test.type` which can be used to define which tests are run in continuous testing, `unit`, `quarkus-test` or `all`.
ja_jp: もう1つの注目すべき点は、 `quarkus.test.type` が追加されたことです。これは、継続的テストで実行するテストを `unit` 、 `quarkus-test` 、 `all` のいずれかに定義するために使用されます。

source: Another option for more complex cases is to provide an Adapter. You can then do the mapping yourself in the adapter.
ja_jp: より複雑なケースには、アダプターを用意するという方法もあります。そうすれば、アダプターの中で自分でマッピングを行うことができます。

source: Another option is log in as a custom user with the username and roles of your choice:
ja_jp: もう 1 つのオプションとして、選択したユーザー名とロールを持つカスタムユーザーとしてログインします。

source: Another option is to use the https://github.com/quarkiverse/quarkus-mailpit[Quarkus Mailpit] extension which provides Dev Services for https://github.com/axllent/mailpit[Mailpit], a nice UI for testing and debugging email sending.
ja_jp: link:https://github.com/quarkiverse/quarkus-mailpit[Quarkus Mailpit] エクステンションを使用すると、 link:https://github.com/axllent/mailpit[メール] 送信のテストやデバッグを行うための優れたUIである link:https://github.com/axllent/mailpit[Mailpit] 用のDev Servicesが提供されます。

source: Another option is to use the *Dev UI* (http://localhost:8080/q/dev-ui/extensions) as the Grafana URL link will be available and if selected it will open a new browser tab directly to the running Grafana instance:
ja_jp: もう 1 つの方法は、*Dev UI* (http://localhost:8080/q/dev-ui/extensions) を使用することです。Grafana URL リンクが使用可能になり、選択すると、実行中の Grafana インスタンスに直接新しいブラウザータブが開きます。

source: Another option is to use the `@BsonCreator` annotation to tell the `PojoCodecProvider` to use the Kotlin data class default constructor, in this case all constructor parameters have to be annotated with `@BsonProperty`: see link:{mongodb-doc-root-url}/bson/pojos/#supporting-pojos-without-no-args-constructors[Supporting pojos without no args constructor].
ja_jp: もうひとつの方法は、 `@BsonCreator` アノテーションを使用して、 `PojoCodecProvider` に Kotlin データクラスのデフォルトコンストラクタを使用するように指示することです。この場合、すべてのコンストラクタパラメータは `@BsonProperty` でアノテーションする必要があります。「 link:{mongodb-doc-root-url}/bson/pojos/#supporting-pojos-without-no-args-constructors[Supporting pojos without no args constru]ctor」を参照してください。

source: Another option is to use the `@BsonCreator` annotation to tell the `PojoCodecProvider` to use the Kotlin data class default constructor, in this case all constructor parameters have to be annotated with `@BsonProperty`: see link:{mongodb-doc-root-url}/fundamentals/data-formats/pojo-customization/#pojos-without-no-argument-constructors[Supporting pojos without no args constructor].
ja_jp: もうひとつの方法として、 `@BsonCreator` アノテーションを使用して、 `PojoCodecProvider` に Kotlin データクラスのデフォルトコンストラクタを使用するように指示します。 この場合、すべてのコンストラクタパラメータは `@BsonProperty` でアノテーションする必要があります。link:{mongodb-doc-root-url}/fundamentals/data-formats/pojo-customization/#pojos-without-no-argument-constructors[引数なしのコンストラクタの無いPOJOのサポート] を参照してください。

source: Another option, that is a feature provided by SmallRye and not part of the specification, is to use configuration to add this global API information. This way, you do not need to have a JAX-RS `Application` class, and you can name the API differently per environment.
ja_jp: また、SmallRyeが提供する機能であり、仕様には含まれていませんが、コンフィギュレーションを使用してこのグローバルAPI情報を追加するという方法もあります。この方法では、JAX-RS `Application` クラスを用意する必要はなく、環境ごとに異なるAPI名を付けることができます。

source: Another option, that is a feature provided by SmallRye and not part of the specification, is to use configuration to add this global API information. This way, you do not need to have a Jakarta REST `Application` class, and you can name the API differently per environment.
ja_jp: SmallRyeが提供する機能で、仕様には含まれていませんが、このグローバルAPI情報を追加するために、設定を使用するという方法もあります。この方法では、jakarta REST `Application` クラスを用意する必要がなく、環境ごとに異なるAPI名を付けることができます。

source: Another possibility is to include the `quarkus.native.additional-build-args` configuration property in your `application.properties`.
ja_jp: もう一つの可能性は、 `application.properties` に `quarkus.native.additional-build-args` 設定プロパティーを含めることです。

source: Another solution is to write a script to do this for you:
ja_jp: もう一つのソリューションは、これを行うためのスクリプトを書くことです:

source: Another thing to take note as well is that Quarkus' gRPC support currently includes 3 different types of gRPC usage:
ja_jp: もうひとつ、QuarkusのgRPCサポートには、現在3種類のgRPCの使用があることにも注意が必要です:

source: Another way to add query parameters to a request is to use `@io.quarkus.rest.client.reactive.ClientQueryParam` on either the REST client interface or a specific method of the interface. The annotation can specify the query parameter name while the value can either be a constant, a configuration property or it can be determined by invoking a method.
ja_jp: リクエストにクエリーパラメーターを追加するもうひとつの方法は、REST クライアントインターフェイスあるいはそのインターフェイスの特定のメソッドに `@io.quarkus.rest.client.reactive.ClientQueryParam` を使用することです。 アノテーションではクエリーパラメーター名を指定し、値は定数や設定プロパティー、あるいはメソッドの起動時に決定できます。

source: Another way to create a `ConfigSource` is via the https://github.com/smallrye/smallrye-config[SmallRye Config] `io.smallrye.config.ConfigSourceFactory` API. The difference between the https://github.com/smallrye/smallrye-config[SmallRye Config] factory and the standard way to create a `ConfigSource` as specified in link:https://github.com/eclipse/microprofile-config/blob/master/spec/src/main/asciidoc/configsources.asciidoc#custom-configsources-via-configsourceprovider[MicroProfile Config], is the factory ability to provide a context with access to the available configuration.
ja_jp: `ConfigSource` を作成するもう一つの方法は、 link:https://github.com/smallrye/smallrye-config[SmallRye Config] `io.smallrye.config.ConfigSourceFactory` API を使用することです。 link:https://github.com/smallrye/smallrye-config[SmallRye Config]のファクトリーと、 link:https://github.com/eclipse/microprofile-config/blob/master/spec/src/main/asciidoc/configsources.asciidoc#custom-configsources-via-configsourceprovider[MicroProfile Config] で指定されている `ConfigSource` を作成する標準的な方法との違いは、利用可能な構成にアクセスできるコンテキストを提供するファクトリーの機能です。

source: Another way to retrieve a `Cache` instance consists in injecting the `io.quarkus.cache.CacheManager` first and then retrieving the desired `Cache` from its name:
ja_jp: `Cache` のインスタンスを取得するもう一つの方法は、まず `io.quarkus.cache.CacheManager` をインジェクトし、その名前から目的の `Cache` を取得するやり方です。

source: Answer all the questions and your lambda will be deployed and the necessary hooks to the API Gateway will be set up. If everything deploys successfully, the root URL of your microservice will be output to the console. Something like this:
ja_jp: すべての質問に答えると、 Lambda がデプロイされ、API Gatewayへの必要なフックが設定されます。すべてが正常にデプロイされると、マイクロサービスのルート URL がコンソールに出力されます。このような感じです。

source: Answer all the questions, and your lambda will be deployed, and the necessary hooks to the API Gateway will be set up. If everything deploys successfully, the root URL of your microservice will be output to the console. Something like this:
ja_jp: すべての質問に答えると、 Lambda がデプロイされ、API Gatewayへの必要なフックが設定されます。すべてが正常にデプロイされると、マイクロサービスのルート URL がコンソールに出力されます。このような感じです。

source: Answering questions on the google group, zulip or other means such as stackoverflow.
ja_jp: googleグループやzulipなど、stackoverflowなどで質問に答えること。

source: Any CDI bean implementing `org.hibernate.validator.spi.messageinterpolation.LocaleResolver` will be taken into account.
ja_jp: `org.hibernate.validator.spi.messageinterpolation.LocaleResolver` を実装しているCDIビーンはすべて考慮されます。

source: Any MCP client that supports the https://modelcontextprotocol.io/specification/2025-03-26[Streamable Protocol, version 2025‑03‑26] can connect using that URL. After a client connects, it will appears on the tab:
ja_jp: https://modelcontextprotocol.io/specification/2025-03-26[Streamable Protocol, version 2025‑03‑26] をサポートするすべての MCP クライアントは、その URL を使用して接続できます。クライアントが接続されると、タブに表示されます。

source: Any `@Dao`-annotated interface, e.g. `FruitDao`;
ja_jp: `@Dao` アノテーションの付与されたインタフェース。例: `FruitDao`;

source: Any `@RestForm` parameter of the type `File`, `Path`, `byte[]` or `Buffer`, as well as any annotated with `@PartType` automatically imply a `@Consumes(MediaType.MULTIPART_FORM_DATA)` on the method if there is no `@Consumes` present.
ja_jp: `File` , `Path` , `byte[]` , `Buffer` , および `@PartType` のアノテーションが付いた `@RestForm` パラメータは、 `@Consumes` が存在しない場合、そのメソッドが `@Consumes(MediaType.MULTIPART_FORM_DATA)` を自動的に意味します。

source: Any `@RestForm` parameter of the type `File`, `Path`, `byte[]`, `Buffer` or `FileUpload`, as well as any annotated with `@PartType` automatically imply a `@Consumes(MediaType.MULTIPART_FORM_DATA)` on the method if there is no `@Consumes` present.
ja_jp: `@RestForm` アノテーションが付けられた `File`、 `Path`、 `byte[]`、 `Buffer`、または `FileUpload` 型のパラメーター、 および `@PartType` アノテーションが付けられたパラメーターは、 `@Consumes` が指定されていない場合、自動的にメソッドに `@Consumes(MediaType.MULTIPART_FORM_DATA)` が 暗黙的に付与されます。

source: Any arbitrary object via the `io.quarkus.deployment.recording.RecorderContext#registerSubstitution(Class, Class, Class)` mechanism
ja_jp: `io.quarkus.deployment.recording.RecorderContext#registerSubstitution(Class, Class, Class)` メカニズムによる任意のオブジェクト

source: Any bean returned by a `@DaoFactory` method (see above for possible bean types).
ja_jp: `@DaoFactory` メソッドから返されるBean（とりうるBean型は上記を参照）。

source: Any change to the entity instance fields must be explicitly pushed to the database by calling `update()` either on the entity or its repository
ja_jp: エンティティーインスタンスのフィールドに対する変更は、エンティティーまたはそのリポジトリーのいずれかで `update()` を呼び出すことで、明示的にデータベースにプッシュする必要があります。

source: Any class annotated with a link:{jaxrsapi}/jakarta/ws/rs/Path.html[`@Path`] annotation can have its methods exposed as REST endpoints, provided they have an HTTP method annotation (see below).
ja_jp: link:{jaxrsapi}/jakarta/ws/rs/Path.html[`@Path`] アノテーションを持つクラスは、HTTP メソッドアノテーション (下記参照) を持っていれば、そのメソッドを REST エンドポイントとして公開することができます。

source: Any class annotated with a link:{jaxrsapi}/javax/ws/rs/Path.html[`@Path`] annotation can have its methods exposed as REST endpoints, provided they have an HTTP method annotation (see below).
ja_jp: link:{jaxrsapi}/javax/ws/rs/Path.html[`@Path`] アノテーションを持つクラスは、HTTP メソッドアノテーション (下記参照) を持っていれば、そのメソッドを REST エンドポイントとして公開することができます。

source: Any client that now connect to the `/graphql` WebSocket connection will receive events on new Heroes being created:
ja_jp: 現在、 `/graphql` WebSocket接続に接続しているすべてのクライアントは、新しいHeroが作成されたときにイベントを受け取ります。

source: Any code that is run as part of a Quarkus application that used the REST Client, can safely use the Reactive REST Client, as all necessary setup for it has been done at the application's static-init phase.
ja_jp: REST クライアントを使用する Quarkus アプリケーションの一部として実行されるコードは、アプリケーションの static-init フェーズで必要な設定がすべて完了しているため、Reactive REST クライアントを安全に使用できます。

source: Any code that is run as part of a Quarkus application that used the RESTEasy Client, can safely use the REST Client, as all necessary setup for it has been done at the application's static-init phase.
ja_jp: RESTEasy クライアントを使用した Quarkus アプリケーションの一部として実行されるコードは、必要なすべてのセットアップがアプリケーションの静的初期化フェーズで完了しているため、REST クライアントを安全に使用できます。

source: Any instance of `Item` can be used directly in the template:
ja_jp: `Item` の任意のインスタンスをテンプレート内で直接使用することができます。

source: Any method may also be annotated with the link:{jaxrsapi}/jakarta/ws/rs/Produces.html[`@Produces`] or link:{jaxrsapi}/jakarta/ws/rs/Consumes.html[`@Consumes`] annotations, in which case they override any eventual class annotation.
ja_jp: どのメソッドにも、link:{jaxrsapi}/jakarta/ws/rs/Produces.html[`@Produces`] または link:{jaxrsapi}/jakarta/ws/rs/Consumes.html[`@Consumes`] アノテーションとして追加できます。その場合、イベントクラスアノテーションはすべてオーバーラードされることになります。

source: Any method may also be annotated with the link:{jaxrsapi}/javax/ws/rs/Produces.html[`@Produces`] or link:{jaxrsapi}/javax/ws/rs/Consumes.html[`@Consumes`] annotations, in which case they override any eventual class annotation.
ja_jp: どのメソッドも link:{jaxrsapi}/javax/ws/rs/Produces.html[`@Produces`] または link:{jaxrsapi}/javax/ws/rs/Consumes.html[`@Consumes`] アノテーションを付けることができ、その場合は最終的にどのクラスアノテーションもオーバーライドされることになります。

source: Any method or class annotated with the `@CanWrite` annotation is secured with this `@PermissionsAllowed` annotation instance.
ja_jp: `@CanWrite` アノテーションが付けられたメソッドまたはクラスは、この `@PermissionsAllowed` アノテーションインスタンスにより保護されます。
